webapp/app/controllers/posts_controller.rb

  def asks
    @posts = Post.all
---
SELECT "posts".* FROM "posts"

  def create
    @post = Post.new(post_params)

    @allPost = Post.all

    @repe = false

    for i in @allPost
      if i.url == @post.url
        repe = true
      end
    end

    if !repe
      respond_to do |format|
        if @post.save
---
SELECT "posts".* FROM "posts"
INSERT INTO "posts" ("title", "url", "text", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["title", ""], ["url", ""], ["text", ""], ["created_at", "2021-04-08 21:02:42.813876"], ["updated_at", "2021-04-08 21:02:42.813876"]]